#+title: Finding out how each rewrite rule effects cost

** Extraction

#+name: extraction-results
#+call: egg-rewrite(bench="q-prod", rules="")

#+RESULTS[85bab39c2a33cd2be0470570dc1aefe7e09b5850]: extraction-results
#+begin_example
   Compiling dios-egraphs v0.1.0 (/home/samthomas/Research/diospyros/src/dios-egraphs)
    Finished release [optimized] target(s) in 2.59s
     Running `src/dios-egraphs/target/release/dios-egraphs q-prod-out/spec.rkt --no-ac --rules ''`
Running egg with timeout 180s, width: 2
Starting run with 30 rules
Egraph big big? 102
Egraph class big? 102
Egraph cost? 503.5590000000001
Rewrite neg-neg-rev cost 0 total 168 eclasses 78
Rewrite sqrt-1-inv cost 0 total 1 eclasses 0
Rewrite neg-minus cost 0 total 12 eclasses 0
Rewrite div-1-inv cost 0 total 102 eclasses 0
Rewrite mul-1-inv cost 0 total 102 eclasses 0
Rewrite add-0-inv cost 0 total 102 eclasses 0
Rewrite expand-zero-get cost 0 total 1 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0.900000000000091 total 12 eclasses 8
Rewrite neg-zero-inv cost 0 total 0 eclasses -1
iter
Egraph big big? 601
Egraph class big? 187
Egraph cost? 502.659
Rewrite litvec cost 0.0989999999999327 total 2 eclasses 0
Rewrite neg-minus-zero-rev cost 0 total 0 eclasses 0
Rewrite vec-mac cost 0.7980000000000018 total 68 eclasses 35
Rewrite neg-neg-rev cost 0 total 16 eclasses 8
Rewrite neg-minus-rev cost 0 total 0 eclasses 0
Rewrite add-0 cost 0 total 0 eclasses 0
Rewrite neg-zero-inv-rev cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv cost 0 total 0 eclasses 0
Rewrite neg_unop cost 0 total 24 eclasses 12
Rewrite neg-minus cost 0 total 167 eclasses 0
Rewrite mul-1 cost 0 total 0 eclasses 0
Rewrite div-1-inv cost 0 total 85 eclasses 0
Rewrite /_binop_vec cost 0 total 12 eclasses 0
Rewrite -_binop_or_zero_vec cost 0 total 1 eclasses 0
Rewrite *_binop_or_zero_vec cost 0 total 13 eclasses 0
Rewrite mul-1-inv cost 0 total 85 eclasses 0
Rewrite div-1 cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv-rev cost 0 total 0 eclasses 0
Rewrite add-0-inv cost 0 total 85 eclasses 0
Rewrite expand-zero-get cost 0 total 0 eclasses 0
Rewrite neg-neg cost 0 total 0 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0.10199999999997544 total 27 eclasses 0
Rewrite neg-zero-inv cost 0 total 0 eclasses 0
iter
Egraph big big? 1186
Egraph class big? 242
Egraph cost? 501.6600000000001
Rewrite litvec cost 0.09900000000004638 total 7 eclasses 0
Rewrite neg-minus-zero-rev cost 0 total 0 eclasses 0
Rewrite vec-mac cost 7.3940000000000055 total 194 eclasses 74
Rewrite neg-neg-rev cost 0 total 94 eclasses 47
Rewrite neg-minus-rev cost 0 total 0 eclasses 0
Rewrite add-0 cost 0 total 0 eclasses 0
Rewrite neg-zero-inv-rev cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv cost 0 total 0 eclasses 0
Rewrite neg_unop cost 0 total 81 eclasses 34
Rewrite neg-minus cost 0 total 16 eclasses 0
Rewrite mul-1 cost 0 total 0 eclasses 0
Rewrite div-1-inv cost 0 total 55 eclasses 0
Rewrite /_binop_vec cost 0 total 47 eclasses 0
Rewrite -_binop_or_zero_vec cost 0 total 58 eclasses 0
Rewrite *_binop_or_zero_vec cost 0.006000000000028649 total 59 eclasses 0
Rewrite mul-1-inv cost 0 total 55 eclasses 0
Rewrite sqrt_unop cost 0 total 1 eclasses 0
Rewrite div-1 cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv-rev cost 0 total 0 eclasses 0
Rewrite vec-mac-add-mul cost 0 total 0 eclasses 0
Rewrite add-0-inv cost 0 total 55 eclasses 0
Rewrite expand-zero-get cost 0 total 0 eclasses 0
Rewrite neg-neg cost 0 total 0 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0 total 85 eclasses 0
Rewrite neg-zero-inv cost 0 total 0 eclasses 0
iter
Egraph big big? 1993
Egraph class big? 397
Egraph cost? 494.161
Rewrite litvec cost 0.5939999999999941 total 12 eclasses 0
Rewrite neg-minus-zero-rev cost 0 total 0 eclasses 0
Rewrite vec-mac cost 103.48700000000008 total 293 eclasses 58
Rewrite neg-neg-rev cost 0 total 216 eclasses 108
Rewrite neg-minus-rev cost 0 total 0 eclasses 0
Rewrite add-0 cost 0 total 0 eclasses 0
Rewrite neg-zero-inv-rev cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv cost 0 total 0 eclasses 0
Rewrite neg_unop cost 0 total 182 eclasses 74
Rewrite neg-minus cost 0 total 94 eclasses 0
Rewrite mul-1 cost 0 total 0 eclasses 0
Rewrite div-1-inv cost 0 total 155 eclasses 0
Rewrite /_binop_vec cost 0 total 108 eclasses 0
Rewrite -_binop_or_zero_vec cost 0 total 108 eclasses 0
Rewrite *_binop_or_zero_vec cost 0.005999999999971806 total 165 eclasses 0
Rewrite mul-1-inv cost 0 total 155 eclasses 0
Rewrite sqrt_unop cost 0 total 0 eclasses 0
Rewrite div-1 cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv-rev cost 0 total 0 eclasses 0
Rewrite vec-mac-add-mul cost 0 total 0 eclasses 0
Rewrite add-0-inv cost 0 total 155 eclasses 0
Rewrite expand-zero-get cost 0 total 0 eclasses 0
Rewrite neg-neg cost 0 total 0 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0 total 145 eclasses 0
Rewrite neg-zero-inv cost 0 total 0 eclasses 0
iter
Egraph big big? 3781
Egraph class big? 637
Egraph cost? 390.07399999999996
Rewrite litvec cost 0.2969999999999686 total 8 eclasses 0
Rewrite neg-minus-zero-rev cost 0 total 0 eclasses 0
Rewrite vec-mac cost 101.68700000000001 total 242 eclasses 37
Rewrite neg-neg-rev cost 0 total 264 eclasses 132
Rewrite neg-minus-rev cost 0 total 0 eclasses 0
Rewrite add-0 cost 0 total 0 eclasses 0
Rewrite neg-zero-inv-rev cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv cost 0 total 0 eclasses 0
Rewrite neg_unop cost 0 total 189 eclasses 57
Rewrite neg-minus cost 0 total 216 eclasses 0
Rewrite mul-1 cost 0 total 0 eclasses 0
Rewrite div-1-inv cost 0 total 240 eclasses 0
Rewrite /_binop_vec cost 0 total 132 eclasses 0
Rewrite -_binop_or_zero_vec cost 0 total 132 eclasses 0
Rewrite *_binop_or_zero_vec cost 0.005999999999971806 total 160 eclasses 0
Rewrite mul-1-inv cost 0 total 240 eclasses 0
Rewrite sqrt_unop cost 0 total 0 eclasses 0
Rewrite div-1 cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv-rev cost 0 total 0 eclasses 0
Rewrite vec-mac-add-mul cost 0 total 0 eclasses 0
Rewrite add-0-inv cost 0 total 240 eclasses 0
Rewrite expand-zero-get cost 0 total 0 eclasses 0
Rewrite neg-neg cost 0 total 0 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0 total 164 eclasses 0
Rewrite neg-zero-inv cost 0 total 0 eclasses 0
iter
Egraph big big? 6008
Egraph class big? 863
Egraph cost? 288.084
Rewrite litvec cost 0.09899999999998954 total 1 eclasses 0
Rewrite neg-minus-zero-rev cost 0 total 0 eclasses 0
Rewrite vec-mac cost 0 total 200 eclasses 41
Rewrite neg-neg-rev cost 0 total 188 eclasses 94
Rewrite neg-minus-rev cost 0 total 0 eclasses 0
Rewrite add-0 cost 0 total 0 eclasses 0
Rewrite neg-zero-inv-rev cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv cost 0 total 0 eclasses 0
Rewrite neg_unop cost 0 total 129 eclasses 35
Rewrite neg-minus cost 0 total 264 eclasses 0
Rewrite mul-1 cost 0 total 0 eclasses 0
Rewrite div-1-inv cost 0 total 226 eclasses 0
Rewrite /_binop_vec cost 0 total 94 eclasses 0
Rewrite -_binop_or_zero_vec cost 0 total 94 eclasses 0
Rewrite *_binop_or_zero_vec cost 0 total 135 eclasses 0
Rewrite mul-1-inv cost 0 total 226 eclasses 0
Rewrite sqrt_unop cost 0 total 0 eclasses 0
Rewrite div-1 cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv-rev cost 0 total 0 eclasses 0
Rewrite vec-mac-add-mul cost 0 total 0 eclasses 0
Rewrite add-0-inv cost 0 total 226 eclasses 0
Rewrite expand-zero-get cost 0 total 0 eclasses 0
Rewrite neg-neg cost 0 total 0 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0 total 113 eclasses 0
Rewrite neg-zero-inv cost 0 total 0 eclasses 0
iter
Egraph big big? 7904
Egraph class big? 1033
Egraph cost? 287.985
Rewrite litvec cost 0 total 5 eclasses 0
Rewrite neg-minus-zero-rev cost 0 total 0 eclasses 0
Rewrite vec-mac cost 8.377999999999986 total 185 eclasses 46
Rewrite neg-neg-rev cost 0 total 152 eclasses 76
Rewrite neg-minus-rev cost 0 total 0 eclasses 0
Rewrite add-0 cost 0 total 0 eclasses 0
Rewrite neg-zero-inv-rev cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv cost 0 total 0 eclasses 0
Rewrite neg_unop cost 0 total 115 eclasses 39
Rewrite neg-minus cost 0 total 188 eclasses 0
Rewrite mul-1 cost 0 total 0 eclasses 0
Rewrite div-1-inv cost 0 total 170 eclasses 0
Rewrite /_binop_vec cost 0 total 76 eclasses 0
Rewrite -_binop_or_zero_vec cost 0 total 76 eclasses 0
Rewrite *_binop_or_zero_vec cost 0.006000000000028649 total 121 eclasses 0
Rewrite mul-1-inv cost 0 total 170 eclasses 0
Rewrite sqrt_unop cost 0 total 0 eclasses 0
Rewrite div-1 cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv-rev cost 0 total 0 eclasses 0
Rewrite vec-mac-add-mul cost 0 total 0 eclasses 0
Rewrite add-0-inv cost 0 total 170 eclasses 0
Rewrite expand-zero-get cost 0 total 0 eclasses 0
Rewrite neg-neg cost 0 total 0 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0 total 90 eclasses 0
Rewrite neg-zero-inv cost 0 total 0 eclasses 0
iter
Egraph big big? 9422
Egraph class big? 1194
Egraph cost? 279.601
Rewrite litvec cost 0.09899999999998954 total 1 eclasses 0
Rewrite neg-minus-zero-rev cost 0 total 0 eclasses 0
Rewrite vec-mac cost 0 total 166 eclasses 31
Rewrite neg-neg-rev cost 0 total 170 eclasses 85
Rewrite neg-minus-rev cost 0 total 0 eclasses 0
Rewrite add-0 cost 0 total 0 eclasses 0
Rewrite neg-zero-inv-rev cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv cost 0 total 0 eclasses 0
Rewrite neg_unop cost 0 total 127 eclasses 42
Rewrite neg-minus cost 0 total 152 eclasses 0
Rewrite mul-1 cost 0 total 0 eclasses 0
Rewrite div-1-inv cost 0 total 161 eclasses 0
Rewrite /_binop_vec cost 0 total 85 eclasses 0
Rewrite -_binop_or_zero_vec cost 0 total 85 eclasses 0
Rewrite *_binop_or_zero_vec cost 0 total 110 eclasses 0
Rewrite mul-1-inv cost 0 total 161 eclasses 0
Rewrite sqrt_unop cost 0 total 0 eclasses 0
Rewrite div-1 cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv-rev cost 0 total 0 eclasses 0
Rewrite vec-mac-add-mul cost 0 total 0 eclasses 0
Rewrite add-0-inv cost 0 total 161 eclasses 0
Rewrite expand-zero-get cost 0 total 0 eclasses 0
Rewrite neg-neg cost 0 total 0 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0 total 105 eclasses 0
Rewrite neg-zero-inv cost 0 total 0 eclasses 0
iter
Egraph big big? 10906
Egraph class big? 1352
Egraph cost? 279.502
Rewrite litvec cost 0 total 1 eclasses 0
Rewrite neg-minus-zero-rev cost 0 total 0 eclasses 0
Rewrite vec-mac cost 11.786000000000001 total 137 eclasses 18
Rewrite neg-neg-rev cost 0 total 146 eclasses 73
Rewrite neg-minus-rev cost 0 total 0 eclasses 0
Rewrite add-0 cost 0 total 0 eclasses 0
Rewrite neg-zero-inv-rev cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv cost 0 total 0 eclasses 0
Rewrite neg_unop cost 1 total 99 eclasses 26
Rewrite neg-minus cost 0 total 170 eclasses 0
Rewrite mul-1 cost 0 total 0 eclasses 0
Rewrite div-1-inv cost 0 total 158 eclasses 0
Rewrite /_binop_vec cost 0 total 73 eclasses 0
Rewrite -_binop_or_zero_vec cost 0 total 73 eclasses 0
Rewrite *_binop_or_zero_vec cost 0.005999999999971806 total 103 eclasses 0
Rewrite mul-1-inv cost 0 total 158 eclasses 0
Rewrite sqrt_unop cost 0 total 0 eclasses 0
Rewrite div-1 cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv-rev cost 0 total 0 eclasses 0
Rewrite vec-mac-add-mul cost 0 total 0 eclasses 0
Rewrite add-0-inv cost 0 total 158 eclasses 0
Rewrite expand-zero-get cost 0 total 0 eclasses 0
Rewrite neg-neg cost 0 total 0 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0 total 86 eclasses 0
Rewrite neg-zero-inv cost 0 total 0 eclasses 0
iter
Egraph big big? 12268
Egraph class big? 1469
Egraph cost? 266.71000000000004
Rewrite litvec cost 0 total 0 eclasses 0
Rewrite neg-minus-zero-rev cost 0 total 0 eclasses 0
Rewrite vec-mac cost 200.17700000000002 total 84 eclasses 8
Rewrite neg-neg-rev cost 0 total 88 eclasses 44
Rewrite neg-minus-rev cost 0 total 0 eclasses 0
Rewrite add-0 cost 0 total 0 eclasses 0
Rewrite neg-zero-inv-rev cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv cost 0 total 0 eclasses 0
Rewrite neg_unop cost 0 total 58 eclasses 14
Rewrite neg-minus cost 0 total 146 eclasses 0
Rewrite mul-1 cost 0 total 0 eclasses 0
Rewrite div-1-inv cost 0 total 117 eclasses 0
Rewrite /_binop_vec cost 0 total 44 eclasses 0
Rewrite -_binop_or_zero_vec cost 0 total 44 eclasses 0
Rewrite *_binop_or_zero_vec cost 0.006000000000000227 total 66 eclasses 0
Rewrite mul-1-inv cost 0 total 117 eclasses 0
Rewrite sqrt_unop cost 0 total 0 eclasses 0
Rewrite div-1 cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv-rev cost 0 total 0 eclasses 0
Rewrite vec-mac-add-mul cost 0 total 0 eclasses 0
Rewrite add-0-inv cost 0 total 117 eclasses 0
Rewrite expand-zero-get cost 0 total 0 eclasses 0
Rewrite neg-neg cost 0 total 0 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0 total 52 eclasses 0
Rewrite neg-zero-inv cost 0 total 0 eclasses 0
iter
Egraph big big? 13201
Egraph class big? 1535
Egraph cost? 66.527
Rewrite litvec cost 0 total 0 eclasses 0
Rewrite neg-minus-zero-rev cost 0 total 0 eclasses 0
Rewrite vec-mac cost 0 total 34 eclasses 0
Rewrite neg-neg-rev cost 0 total 44 eclasses 22
Rewrite neg-minus-rev cost 0 total 0 eclasses 0
Rewrite add-0 cost 0 total 0 eclasses 0
Rewrite neg-zero-inv-rev cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv cost 0 total 0 eclasses 0
Rewrite neg_unop cost 0 total 24 eclasses 2
Rewrite neg-minus cost 0 total 88 eclasses 0
Rewrite mul-1 cost 0 total 0 eclasses 0
Rewrite div-1-inv cost 0 total 66 eclasses 0
Rewrite /_binop_vec cost 0 total 22 eclasses 0
Rewrite -_binop_or_zero_vec cost 0 total 22 eclasses 0
Rewrite *_binop_or_zero_vec cost 0 total 32 eclasses 0
Rewrite mul-1-inv cost 0 total 66 eclasses 0
Rewrite sqrt_unop cost 0 total 0 eclasses 0
Rewrite div-1 cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv-rev cost 0 total 0 eclasses 0
Rewrite vec-mac-add-mul cost 0 total 0 eclasses 0
Rewrite add-0-inv cost 0 total 66 eclasses 0
Rewrite expand-zero-get cost 0 total 0 eclasses 0
Rewrite neg-neg cost 0 total 0 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0 total 24 eclasses 0
Rewrite neg-zero-inv cost 0 total 0 eclasses 0
iter
Egraph big big? 13689
Egraph class big? 1559
Egraph cost? 66.527
Rewrite litvec cost 0 total 0 eclasses 0
Rewrite neg-minus-zero-rev cost 0 total 0 eclasses 0
Rewrite vec-mac cost 0 total 10 eclasses 2
Rewrite neg-neg-rev cost 0 total 4 eclasses 2
Rewrite neg-minus-rev cost 0 total 0 eclasses 0
Rewrite add-0 cost 0 total 0 eclasses 0
Rewrite neg-zero-inv-rev cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv cost 0 total 0 eclasses 0
Rewrite neg_unop cost 0 total 2 eclasses 0
Rewrite neg-minus cost 0 total 44 eclasses 0
Rewrite mul-1 cost 0 total 0 eclasses 0
Rewrite div-1-inv cost 0 total 24 eclasses 0
Rewrite /_binop_vec cost 0 total 2 eclasses 0
Rewrite -_binop_or_zero_vec cost 0 total 2 eclasses 0
Rewrite *_binop_or_zero_vec cost 0 total 8 eclasses 0
Rewrite mul-1-inv cost 0 total 24 eclasses 0
Rewrite sqrt_unop cost 0 total 0 eclasses 0
Rewrite div-1 cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv-rev cost 0 total 0 eclasses 0
Rewrite vec-mac-add-mul cost 0 total 0 eclasses 0
Rewrite add-0-inv cost 0 total 24 eclasses 0
Rewrite expand-zero-get cost 0 total 0 eclasses 0
Rewrite neg-neg cost 0 total 0 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0 total 2 eclasses 0
Rewrite neg-zero-inv cost 0 total 0 eclasses 0
iter
Egraph big big? 13835
Egraph class big? 1563
Egraph cost? 66.527
Rewrite litvec cost 0 total 2 eclasses 0
Rewrite neg-minus-zero-rev cost 0 total 0 eclasses 0
Rewrite vec-mac cost 0 total 2 eclasses 0
Rewrite neg-neg-rev cost 0 total 4 eclasses 2
Rewrite neg-minus-rev cost 0 total 0 eclasses 0
Rewrite add-0 cost 0 total 0 eclasses 0
Rewrite neg-zero-inv-rev cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv cost 0 total 0 eclasses 0
Rewrite neg_unop cost 0 total 4 eclasses 2
Rewrite neg-minus cost 0 total 4 eclasses 0
Rewrite mul-1 cost 0 total 0 eclasses 0
Rewrite div-1-inv cost 0 total 4 eclasses 0
Rewrite /_binop_vec cost 0 total 2 eclasses 0
Rewrite -_binop_or_zero_vec cost 0 total 2 eclasses 0
Rewrite *_binop_or_zero_vec cost 0 total 2 eclasses 0
Rewrite mul-1-inv cost 0 total 4 eclasses 0
Rewrite sqrt_unop cost 0 total 0 eclasses 0
Rewrite div-1 cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv-rev cost 0 total 0 eclasses 0
Rewrite vec-mac-add-mul cost 0 total 0 eclasses 0
Rewrite add-0-inv cost 0 total 4 eclasses 0
Rewrite expand-zero-get cost 0 total 0 eclasses 0
Rewrite neg-neg cost 0 total 0 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0 total 2 eclasses 0
Rewrite neg-zero-inv cost 0 total 0 eclasses 0
iter
Egraph big big? 13871
Egraph class big? 1567
Egraph cost? 66.527
Rewrite litvec cost 0 total 0 eclasses 0
Rewrite neg-minus-zero-rev cost 0 total 0 eclasses 0
Rewrite vec-mac cost 0 total 2 eclasses 0
Rewrite neg-neg-rev cost 0 total 4 eclasses 2
Rewrite neg-minus-rev cost 0 total 0 eclasses 0
Rewrite add-0 cost 0 total 0 eclasses 0
Rewrite neg-zero-inv-rev cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv cost 0 total 0 eclasses 0
Rewrite neg_unop cost 0 total 2 eclasses 0
Rewrite neg-minus cost 0 total 4 eclasses 0
Rewrite mul-1 cost 0 total 0 eclasses 0
Rewrite div-1-inv cost 0 total 4 eclasses 0
Rewrite /_binop_vec cost 0 total 2 eclasses 0
Rewrite -_binop_or_zero_vec cost 0 total 2 eclasses 0
Rewrite *_binop_or_zero_vec cost 0 total 2 eclasses 0
Rewrite mul-1-inv cost 0 total 4 eclasses 0
Rewrite sqrt_unop cost 0 total 0 eclasses 0
Rewrite div-1 cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv-rev cost 0 total 0 eclasses 0
Rewrite vec-mac-add-mul cost 0 total 0 eclasses 0
Rewrite add-0-inv cost 0 total 4 eclasses 0
Rewrite expand-zero-get cost 0 total 0 eclasses 0
Rewrite neg-neg cost 0 total 0 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0 total 2 eclasses 0
Rewrite neg-zero-inv cost 0 total 0 eclasses 0
iter
Egraph big big? 13903
Egraph class big? 1569
Egraph cost? 66.527
Rewrite litvec cost 0 total 0 eclasses 0
Rewrite neg-minus-zero-rev cost 0 total 0 eclasses 0
Rewrite vec-mac cost 0 total 0 eclasses 0
Rewrite neg-neg-rev cost 0 total 0 eclasses 0
Rewrite neg-minus-rev cost 0 total 0 eclasses 0
Rewrite add-0 cost 0 total 0 eclasses 0
Rewrite neg-zero-inv-rev cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv cost 0 total 0 eclasses 0
Rewrite neg_unop cost 0 total 0 eclasses 0
Rewrite neg-minus cost 0 total 4 eclasses 0
Rewrite mul-1 cost 0 total 0 eclasses 0
Rewrite div-1-inv cost 0 total 2 eclasses 0
Rewrite /_binop_vec cost 0 total 0 eclasses 0
Rewrite -_binop_or_zero_vec cost 0 total 0 eclasses 0
Rewrite *_binop_or_zero_vec cost 0 total 0 eclasses 0
Rewrite mul-1-inv cost 0 total 2 eclasses 0
Rewrite sqrt_unop cost 0 total 0 eclasses 0
Rewrite div-1 cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv-rev cost 0 total 0 eclasses 0
Rewrite vec-mac-add-mul cost 0 total 0 eclasses 0
Rewrite add-0-inv cost 0 total 2 eclasses 0
Rewrite expand-zero-get cost 0 total 0 eclasses 0
Rewrite neg-neg cost 0 total 0 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0 total 0 eclasses 0
Rewrite neg-zero-inv cost 0 total 0 eclasses 0
iter
Egraph big big? 13913
Egraph class big? 1569
Egraph cost? 66.527
Rewrite litvec cost 0 total 0 eclasses 0
Rewrite neg-minus-zero-rev cost 0 total 0 eclasses 0
Rewrite vec-mac cost 0 total 0 eclasses 0
Rewrite neg-neg-rev cost 0 total 0 eclasses 0
Rewrite neg-minus-rev cost 0 total 0 eclasses 0
Rewrite add-0 cost 0 total 0 eclasses 0
Rewrite neg-zero-inv-rev cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv cost 0 total 0 eclasses 0
Rewrite neg_unop cost 0 total 0 eclasses 0
Rewrite neg-minus cost 0 total 0 eclasses 0
Rewrite mul-1 cost 0 total 0 eclasses 0
Rewrite div-1-inv cost 0 total 0 eclasses 0
Rewrite /_binop_vec cost 0 total 0 eclasses 0
Rewrite -_binop_or_zero_vec cost 0 total 0 eclasses 0
Rewrite *_binop_or_zero_vec cost 0 total 0 eclasses 0
Rewrite mul-1-inv cost 0 total 0 eclasses 0
Rewrite sqrt_unop cost 0 total 0 eclasses 0
Rewrite div-1 cost 0 total 0 eclasses 0
Rewrite sqrt-1-inv-rev cost 0 total 0 eclasses 0
Rewrite vec-mac-add-mul cost 0 total 0 eclasses 0
Rewrite add-0-inv cost 0 total 0 eclasses 0
Rewrite expand-zero-get cost 0 total 0 eclasses 0
Rewrite neg-neg cost 0 total 0 eclasses 0
Rewrite neg-minus-zero cost 0 total 0 eclasses 0
Rewrite +_binop_or_zero_vec cost 0 total 0 eclasses 0
Rewrite neg-zero-inv cost 0 total 0 eclasses 0
iter
iter
Egraph big big? 13913
Runner report
=============
  Stop reason: Saturated
  Iterations: 17
  Egraph size: 13913 nodes, 1569 classes, 13913 memo
  Rebuilds: 2358, 138.71 per iter
  Total time: 5.705600538
    Search:  (0.01) 0.07843709
    Apply:   (0.98) 5.612467701000001
    Rebuild: (0.00) 0.014664583
Stopped after 17 iterations, reason: Some(Saturated)
Egraph cost? 66.527

Cost: 66.527
#+end_example

Let's do some manual look at the data.

First let's only look at the rules that actually did anything for an iteration.
#+begin_src python :results output verbatim :var data=extraction-results
non_zero_rule = []
n_iters = 0
for line in data.split("\n"):
    if "Rewrite" in line:
        parts = line.split(" ")
        name, cost, total, eclasses = parts[1], parts[3], parts[5], parts[7]
        if cost != "0" or total != "0" or eclasses != "0":
            if name not in non_zero_rule: non_zero_rule.append(name)
            print(f"{name}: {cost}, {total}, {eclasses}")
    elif "iter" in line:
        print(f"======.{n_iters}.=======")
        n_iters += 1
    elif "Cost:" in line:
        print(line)

non_zero_rule.sort()
print(non_zero_rule)
#+end_src

#+RESULTS:
#+begin_example
neg-neg-rev: 0, 168, 78
sqrt-1-inv: 0, 1, 0
neg-minus: 0, 12, 0
div-1-inv: 0, 102, 0
mul-1-inv: 0, 102, 0
add-0-inv: 0, 102, 0
expand-zero-get: 0, 1, 0
+_binop_or_zero_vec: 0.900000000000091, 12, 8
neg-zero-inv: 0, 0, -1
======.0.=======
litvec: 0.0989999999999327, 2, 0
vec-mac: 0.7980000000000018, 68, 35
neg-neg-rev: 0, 16, 8
neg_unop: 0, 24, 12
neg-minus: 0, 167, 0
div-1-inv: 0, 85, 0
/_binop_vec: 0, 12, 0
-_binop_or_zero_vec: 0, 1, 0
,*_binop_or_zero_vec: 0, 13, 0
mul-1-inv: 0, 85, 0
add-0-inv: 0, 85, 0
+_binop_or_zero_vec: 0.10199999999997544, 27, 0
======.1.=======
litvec: 0.09900000000004638, 7, 0
vec-mac: 7.3940000000000055, 194, 74
neg-neg-rev: 0, 94, 47
neg_unop: 0, 81, 34
neg-minus: 0, 16, 0
div-1-inv: 0, 55, 0
/_binop_vec: 0, 47, 0
-_binop_or_zero_vec: 0, 58, 0
,*_binop_or_zero_vec: 0.006000000000028649, 59, 0
mul-1-inv: 0, 55, 0
sqrt_unop: 0, 1, 0
add-0-inv: 0, 55, 0
+_binop_or_zero_vec: 0, 85, 0
======.2.=======
litvec: 0.5939999999999941, 12, 0
vec-mac: 103.48700000000008, 293, 58
neg-neg-rev: 0, 216, 108
neg_unop: 0, 182, 74
neg-minus: 0, 94, 0
div-1-inv: 0, 155, 0
/_binop_vec: 0, 108, 0
-_binop_or_zero_vec: 0, 108, 0
,*_binop_or_zero_vec: 0.005999999999971806, 165, 0
mul-1-inv: 0, 155, 0
add-0-inv: 0, 155, 0
+_binop_or_zero_vec: 0, 145, 0
======.3.=======
litvec: 0.2969999999999686, 8, 0
vec-mac: 101.68700000000001, 242, 37
neg-neg-rev: 0, 264, 132
neg_unop: 0, 189, 57
neg-minus: 0, 216, 0
div-1-inv: 0, 240, 0
/_binop_vec: 0, 132, 0
-_binop_or_zero_vec: 0, 132, 0
,*_binop_or_zero_vec: 0.005999999999971806, 160, 0
mul-1-inv: 0, 240, 0
add-0-inv: 0, 240, 0
+_binop_or_zero_vec: 0, 164, 0
======.4.=======
litvec: 0.09899999999998954, 1, 0
vec-mac: 0, 200, 41
neg-neg-rev: 0, 188, 94
neg_unop: 0, 129, 35
neg-minus: 0, 264, 0
div-1-inv: 0, 226, 0
/_binop_vec: 0, 94, 0
-_binop_or_zero_vec: 0, 94, 0
,*_binop_or_zero_vec: 0, 135, 0
mul-1-inv: 0, 226, 0
add-0-inv: 0, 226, 0
+_binop_or_zero_vec: 0, 113, 0
======.5.=======
litvec: 0, 5, 0
vec-mac: 8.377999999999986, 185, 46
neg-neg-rev: 0, 152, 76
neg_unop: 0, 115, 39
neg-minus: 0, 188, 0
div-1-inv: 0, 170, 0
/_binop_vec: 0, 76, 0
-_binop_or_zero_vec: 0, 76, 0
,*_binop_or_zero_vec: 0.006000000000028649, 121, 0
mul-1-inv: 0, 170, 0
add-0-inv: 0, 170, 0
+_binop_or_zero_vec: 0, 90, 0
======.6.=======
litvec: 0.09899999999998954, 1, 0
vec-mac: 0, 166, 31
neg-neg-rev: 0, 170, 85
neg_unop: 0, 127, 42
neg-minus: 0, 152, 0
div-1-inv: 0, 161, 0
/_binop_vec: 0, 85, 0
-_binop_or_zero_vec: 0, 85, 0
,*_binop_or_zero_vec: 0, 110, 0
mul-1-inv: 0, 161, 0
add-0-inv: 0, 161, 0
+_binop_or_zero_vec: 0, 105, 0
======.7.=======
litvec: 0, 1, 0
vec-mac: 11.786000000000001, 137, 18
neg-neg-rev: 0, 146, 73
neg_unop: 1, 99, 26
neg-minus: 0, 170, 0
div-1-inv: 0, 158, 0
/_binop_vec: 0, 73, 0
-_binop_or_zero_vec: 0, 73, 0
,*_binop_or_zero_vec: 0.005999999999971806, 103, 0
mul-1-inv: 0, 158, 0
add-0-inv: 0, 158, 0
+_binop_or_zero_vec: 0, 86, 0
======.8.=======
vec-mac: 200.17700000000002, 84, 8
neg-neg-rev: 0, 88, 44
neg_unop: 0, 58, 14
neg-minus: 0, 146, 0
div-1-inv: 0, 117, 0
/_binop_vec: 0, 44, 0
-_binop_or_zero_vec: 0, 44, 0
,*_binop_or_zero_vec: 0.006000000000000227, 66, 0
mul-1-inv: 0, 117, 0
add-0-inv: 0, 117, 0
+_binop_or_zero_vec: 0, 52, 0
======.9.=======
vec-mac: 0, 34, 0
neg-neg-rev: 0, 44, 22
neg_unop: 0, 24, 2
neg-minus: 0, 88, 0
div-1-inv: 0, 66, 0
/_binop_vec: 0, 22, 0
-_binop_or_zero_vec: 0, 22, 0
,*_binop_or_zero_vec: 0, 32, 0
mul-1-inv: 0, 66, 0
add-0-inv: 0, 66, 0
+_binop_or_zero_vec: 0, 24, 0
======.10.=======
vec-mac: 0, 10, 2
neg-neg-rev: 0, 4, 2
neg_unop: 0, 2, 0
neg-minus: 0, 44, 0
div-1-inv: 0, 24, 0
/_binop_vec: 0, 2, 0
-_binop_or_zero_vec: 0, 2, 0
,*_binop_or_zero_vec: 0, 8, 0
mul-1-inv: 0, 24, 0
add-0-inv: 0, 24, 0
+_binop_or_zero_vec: 0, 2, 0
======.11.=======
litvec: 0, 2, 0
vec-mac: 0, 2, 0
neg-neg-rev: 0, 4, 2
neg_unop: 0, 4, 2
neg-minus: 0, 4, 0
div-1-inv: 0, 4, 0
/_binop_vec: 0, 2, 0
-_binop_or_zero_vec: 0, 2, 0
,*_binop_or_zero_vec: 0, 2, 0
mul-1-inv: 0, 4, 0
add-0-inv: 0, 4, 0
+_binop_or_zero_vec: 0, 2, 0
======.12.=======
vec-mac: 0, 2, 0
neg-neg-rev: 0, 4, 2
neg_unop: 0, 2, 0
neg-minus: 0, 4, 0
div-1-inv: 0, 4, 0
/_binop_vec: 0, 2, 0
-_binop_or_zero_vec: 0, 2, 0
,*_binop_or_zero_vec: 0, 2, 0
mul-1-inv: 0, 4, 0
add-0-inv: 0, 4, 0
+_binop_or_zero_vec: 0, 2, 0
======.13.=======
neg-minus: 0, 4, 0
div-1-inv: 0, 2, 0
mul-1-inv: 0, 2, 0
add-0-inv: 0, 2, 0
======.14.=======
======.15.=======
======.16.=======
======.17.=======
======.18.=======
Cost: 66.527
['*_binop_or_zero_vec', '+_binop_or_zero_vec', '-_binop_or_zero_vec', '/_binop_vec', 'add-0-inv', 'div-1-inv', 'expand-zero-get', 'litvec', 'mul-1-inv', 'neg-minus', 'neg-neg-rev', 'neg-zero-inv', 'neg_unop', 'sqrt-1-inv', 'sqrt_unop', 'vec-mac']
#+end_example

I'm trying to see if I can use this data to select only the rules that actually do anything. However, strangely enough if I filter out rules that never change the cost or the size of the graph, the final cost is way higher than when I leave those rules in.

Let's look at the rules that never do anything

#+begin_src python :results output verbatim :var data=extraction-results
zero_rules = {}
n_iters = 0
for line in data.split("\n"):
    if "Rewrite" in line:
        parts = line.split(" ")
        name, cost , size = parts[1], parts[3], parts[5]
        if cost == "0" and size == "0":
            if name not in zero_rules:
                zero_rules[name] = 1
            else:
                zero_rules[name] += 1
    elif "iter" in line:
        n_iters += 1
    elif "Cost:" in line:
        print(line)

for name, n in zero_rules.items():
    if n == n_iters:
        print(name)
    else:
        print(f"not {name} {n} {n_iters}")
#+end_src

#+RESULTS:
#+begin_example
Cost: 66.527
not neg-zero-inv 16 19
not neg-minus-zero 16 19
not sqrt-1-inv 15 19
not neg-neg 15 19
not sqrt-1-inv-rev 15 19
not neg-minus-zero-rev 15 19
not div-1 15 19
not neg-minus-rev 15 19
not add-0 15 19
not mul-1 15 19
not expand-zero-get 15 19
not neg-zero-inv-rev 15 19
not vec-mac-add-mul 14 19
not sqrt_unop 13 19
not litvec 6 19
not neg-neg-rev 2 19
not /_binop 2 19
not -_binop_or_zero 2 19
not *_binop_or_zero 2 19
not vec-mac 2 19
not +_binop_or_zero 2 19
not neg_unop 2 19
not mul-1-inv 1 19
not div-1-inv 1 19
not add-0-inv 1 19
not neg-minus 1 19
#+end_example

So that didn't tell me anything. There are no rules that never have any effect. That makes sense. So what does =.total_size()= actually give me.

Total size seems to give me the total number of =enodes=. There is also a way to get the total number of =eclasses=. I added some logging to get the size of =eclasses=.

